Repository: FlorianGrimm/ilovesharepoint
Catalog: iLoveSharePoint.Activities2010/iLoveSharePoint.Activities/Features/ILSPSPDActions/Resources.*.resx
Languages: de

# BuildStringActivity_DynamicString
source: String
de: Text

# BuildStringActivity_Name
source: Build Dynamic String
de: Dynamische Zeichenkette

# BuildStringActivity_Result
source: Result
de: Ergebnis

# BuildStringActivity_Sentence
source: Build %1 (Output: %2).
de: %1 (Output: %2).

# CreateSiteActivity_Description
source: Description
de: Beschreibung

# CreateSiteActivity_Error
source: Error
de: Fehler

# CreateSiteActivity_InheritPermissions
source: Inherit permissions
de: Berechtigungen vererben

# CreateSiteActivity_InheritTopLinkBar
source: Inherit top link bar
de: Top-Navigation vererben

# CreateSiteActivity_Language
source: Language code
de: Sprachcode

# CreateSiteActivity_Name
source: Create a Site
de: Neue Website erstellen

# CreateSiteActivity_Result
source: Site URL
de: Ergebnis

# CreateSiteActivity_Sentence
source: Create a new site at %1 with %2, %3, %4, language code: %7 (0=inherit from parent site), inherit permissions: %5, inherit top navigation: %8 (Output: %6; Error: %9).
de: Erstelle neue Website mit %1, %2, %3, %4, Sprachcode: %7 (0=Sprache vererben), Berechtigungen vererben: %5 und Top-Navigation vererben: %8 (Ausgabe: %6; Fehler: %9).

# CreateSiteActivity_Template
source: Template
de: Vorlage

# CreateSiteActivity_Title
source: Title
de: Titel

# CreateSiteActivity_Url
source: URL
de: URL der Website

# CreateXmlFileActivity_FileItemId
source: Item ID
de: Listeintrags ID

# CreateXmlFileActivity_FileName
source: File Name
de: Name

# CreateXmlFileActivity_ListId
source: List
de: Liste

# CreateXmlFileActivity_Name
source: Create XM- Document
de: XML-Dokument erstellen

# CreateXmlFileActivity_Overwrite
source: Overwrite
de: überschreiben

# CreateXmlFileActivity_Sentence
source: Create XML Document %2 in %1 with %3. Overwrite when exists: %4 (Output: %5, %6).
de: XML-Dokument in Liste %1 mit Namen %2 und XML %3 erstellen. Vorhandene Datei überschreiben: %4. Listeintrags ID speichern in %5.

# FeatureDescription
source: Advanced Workflow Actions for SharePoint Designer 2010.
de: Enthält erweiterte SharePoint Designer 2010 Workflow Aktivitäten.

# FeatureTitle
source: iLove SharePoint - SharePoint Designer 2010 Workflow Actions
de: iLove SharePoint - SharePoint Designer 2010 Workflow Aktivitäten

# GetParentFolderActivity_FolderItemId
source: Folder Item ID
de: Ordner-ID

# GetParentFolderActivity_ListItem
source: List Item
de: Listeintrag

# GetParentFolderActivity_Name
source: Get Parent Folder
de: Finde übergeordente Ordner

# GetParentFolderActivity_Sentence
source: Get parent folder from %1 (Output: %2).
de: Finde den übergeordente Ordner von %1 (Ausgabe: %2).

# HttpRequestActivity_Sentence
source: HTTP-Request %1; Method: %2; Header: %3; Body: %4; User: %6 and Password: %7 or Secure Store AppId: %8 (Output: %5).
de: HTTP-Request Address: %1; Method: %2; Header: %3; Body: %4; User: %6 and Password: %7 or Secure Store AppId: %8 (Ausgabe: %5).

# QueryXmlActivity_Name
source: Query XML
de: XML abfragen

# QueryXmlActivity_Result
source: Result
de: Ergebnis

# QueryXmlActivity_SelectionType
source: Selection Type
de: Selektionstyp

# QueryXmlActivity_Sentence
source: Query %1 with %2 expression and select %3 (Output: %4).
de: XML %1 mit %2 Ausdruck %2 abragen und %3 selektieren (Ausgabe: %4)

# QueryXmlFileActivity_ListItem
source: List Item
de: Listeintrag

# QueryXmlFileActivity_Name
source: Query XML-Document
de: XML-Dokument Abfragen

# QueryXmlFileActivity_Result
source: Result
de: Ergebnis

# QueryXmlFileActivity_SelectionType
source: Selection Type
de: Selektionstyp

# QueryXmlFileActivity_Sentence
source: Query XML-Document %1 with %2 expression and select %3. (Output: %4).
de: XML-Dokument %1 mit %2 abfragen und %3 selektieren (Ausgabe: %4).

# RegexActivity_Name
source: Extract String with Regular Expression
de: Extrahiere Zeichenkette mit regulärem Ausdruck

# RegexActivity_Result
source: Output
de: Ergebnis

# RegexActivity_Sentence
source: Execute %1 on %2 (Output: %3).
de: Führe %1 auf %2 aus (Ausgabe: %3).

# RegexReplaceActivity_Name
source: Replace String with Regular Expression
de: Ersetze Zeichenkette mit regulärem Ausdruck

# RegexReplaceActivity_Result
source: Output
de: Ergebnis

# RegexReplaceActivity_Sentence
source: Execute %1 on %2 and replace matches with %3 (Output: %4).
de: Führe %1 auf %2 aus und ersetze Treffer mit %3 (Ausgabe: %4).

# SetXmlActivity_Name
source: Set XML
de: XML setzen

# SetXmlActivity_Result
source: Result
de: Ergebnis

# SetXmlActivity_SelectionType
source: Select
de: Selektionstyp

# SetXmlActivity_Sentence
source: Query %1 with %2 and set %3 to %4 (Output: %5).
de: Frage %1 mit %2 ab und setze %3 zu %4 (Ausgabe: %5).

# SetXmlActivity_Value
source: Value
de: Text

# SetXmlActivity_Xml
source: XML
de: XML-Text

# SqlActivity_ConnectionString
source: Connection String
de: Verbindungszeichenfolge

# SqlActivity_Name
source: Execute SQL
de: SQL-Abfrage ausführen

# SqlActivity_Result
source: Result
de: Ergebnis

# SqlActivity_Sentence
source: Execute %3 using %1 and %2. Optional: Get User ID and Password from Secure Store %5 (Output %4).
de: Führe %3 aus. Benutze %1 und %2. Optional: User ID und Passwort aus Secure Store %5 hinzufügen (Ausgabe: %4).

# UpdateXmlFileActivity_ListItem
source: List Item
de: Listeneintrag

# UpdateXmlFileActivity_Name
source: Update XML-Document
de: XML-Dokument aktualisieren

# UpdateXmlFileActivity_Sentence
source: Update XML File %1 with %2.
de: XML-Dokument %1 mit %2 aktualisieren.

# WaitForExternalEventActivity_ExternalData
source: data
de: Daten

# WaitForExternalEventActivity_Name
source: Wait for External Data
de: Warte auf extene Daten

# WaitForExternalEventActivity_Sentence
source: Wait for external data (output: %1; Correlation Id: %2).
de: Warte auf extene Daten (Ergebnis: %1; Correlation Id: %2).

# WebServiceActivity_Name
source: Call a Web Service
de: Webservice aufrufen

# WebServiceActivity_Password
source: Password
de: Passwort

# WebServiceActivity_Response
source: SOAP Response
de: Antwort

# WebServiceActivity_Sentence
source: Call Web Service at %1 with %2, %3, %4, User Name: %6 and Password: %7 or Secure Store AppId: %8 (Output: %5).
de: Webservice URL: %1; SOAP Version %2; SOAP Action %3; SOAP Envelope %4; Benutzer: %6 und Passwort %7 oder Secure Store AppId: %8 (Ausgabe: %5).

# WebServiceActivity_User
source: User
de: Benutzer

# PowerActivity_Name
source: Execute PowerShell Script
de: PowerShell Skript ausführen

# PowerActivity_Script
source: Script
de: Skript

# PowerActivity_Sentence
source: Execute PowerShell: %1 (Signature %2; $var1: %3; $var2: %4; $var3: %5; $var4: %6; $var5: %7; $secure: %8; Secure Store AppId: %9).
de: PowerShell %1 ausführen (Signature %2; $var1: %3; $var2: %4; $var3: %5; $var4: %6; $var5: %7; $secure: %8; Secure Store AppId: %9 ).
